In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
netflix_file = "Transformation Center/cleaned_netflix.csv"
netflix_df = pd.read_csv(netflix_file)

oscars_file = "Transformation Center/cleaned_oscars.csv"
oscars_df = pd.read_csv(oscars_file)

tmdb_file = "Transformation Center/clean_tmdb.csv"
tmdb_df = pd.read_csv(tmdb_file)

In [3]:
netflix_df.head()

   Movie           Director        Country  Year
0   7:19  Jorge Michel Grau         Mexico  2016
1  23:59       Gilbert Chan      Singapore  2011
2      9        Shane Acker  United States  2009
3     21     Robert Luketic  United States  2008
4    122    Yasir Al Yasiri          Egypt  2019

In [4]:
oscars_df.head()

                            Movie          Award  Year_of_Award
0             Two Arabian Knights  Best Director           1927
1                 The Divine Lady  Best Director           1930
2  All Quiet on the Western Front  Best Director           1931
3                          Skippy  Best Director           1932
4                        Bad Girl  Best Director           1933

In [5]:
tmdb_df.head()

,Id,Movie,Description,Vote_Count,Vote_Average
0,0,Ad Astra,"The near future, a time when both hope and har...",2853,5.9
1,1,Bloodshot,"After he and his wife are murdered, marine Ray...",1349,7.2
2,2,Bad Boys for Life,Marcus and Mike are forced to confront new thr...,2530,7.1
3,3,Ant-Man,Armed with the astonishing ability to shrink i...,13611,7.1
4,4,Percy Jackson: Sea of Monsters,"In their quest to confront the ultimate evil, ...",3542,5.9

In [6]:
#Connect to local database
rds_connection_string = "postgres:postgres@localhost:5432/Movies_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [7]:
#Check for tables
engine.table_names()

['tmdb', 'netflix', 'oscars']

In [8]:
#Use pandas to load csv converted DataFrames into database
tmdb_df.to_sql(name='tmdb', con=engine, if_exists='append', index=False)

In [9]:
netflix_df.to_sql(name='netflix', con=engine, if_exists='append', index=False)

In [10]:
oscars_df.to_sql(name='oscars', con=engine, if_exists='append', index=False)

In [11]:
#Confirm data has beem added by querying each table
pd.read_sql_query('select * from tmdb', con=engine).head()

,Id,Movie,Description,Vote_Count,Vote_Average
0,0,Ad Astra,"The near future, a time when both hope and har...",2853,5.9
1,1,Bloodshot,"After he and his wife are murdered, marine Ray...",1349,7.2
2,2,Bad Boys for Life,Marcus and Mike are forced to confront new thr...,2530,7.1
3,3,Ant-Man,Armed with the astonishing ability to shrink i...,13611,7.1
4,4,Percy Jackson: Sea of Monsters,"In their quest to confront the ultimate evil, ...",3542,5.9

In [12]:
pd.read_sql_query('select * from oscars', con=engine).head()

                            Movie          Award  Year_of_Award
0             Two Arabian Knights  Best Director           1927
1                 The Divine Lady  Best Director           1930
2  All Quiet on the Western Front  Best Director           1931
3                          Skippy  Best Director           1932
4                        Bad Girl  Best Director           1933

In [13]:
pd.read_sql_query('select * from netflix', con=engine).head()

   Movie           Director        Country  Year
0   7:19  Jorge Michel Grau         Mexico  2016
1  23:59       Gilbert Chan      Singapore  2011
2      9        Shane Acker  United States  2009
3     21     Robert Luketic  United States  2008
4    122    Yasir Al Yasiri          Egypt  2019